sterentev/atdf-device-asm-include/inc/ATmega640.inc
; ----------	Register GPIOR2 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 2 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 1 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose IO Register 0 bit 7
.equ	GPIOR06		= 6		; 0x40 - General Purpose IO Register 0 bit 6
.equ	GPIOR05		= 5		; 0x20 - General Purpose IO Register 0 bit 5
.equ	GPIOR04		= 4		; 0x10 - General Purpose IO Register 0 bit 4
.equ	GPIOR03		= 3		; 0x08 - General Purpose IO Register 0 bit 3
.equ	GPIOR02		= 2		; 0x04 - General Purpose IO Register 0 bit 2
.equ	GPIOR01		= 1		; 0x02 - General Purpose IO Register 0 bit 1
.equ	GPIOR00		= 0		; 0x01 - General Purpose IO Register 0 bit 0

; ----------	Register PRR1 bits		------------------------
.equ	PRTIM5		= 5		; 0x20 - Power Reduction Timer/Counter5
.equ	PRTIM4		= 4		; 0x10 - Power Reduction Timer/Counter4
.equ	PRTIM3		= 3		; 0x08 - Power Reduction Timer/Counter3
.equ	PRUSART3	= 2		; 0x04 - Power Reduction USART3
.equ	PRUSART2	= 1		; 0x02 - Power Reduction USART2
.equ	PRUSART1	= 0		; 0x01 - Power Reduction USART1

; ----------	Register PRR0 bits		------------------------
.equ	PRTWI		= 7		; 0x80 - Power Reduction TWI
.equ	PRTIM2		= 6		; 0x40 - Power Reduction Timer/Counter2
.equ	PRTIM0		= 5		; 0x20 - Power Reduction Timer/Counter0
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface
.equ	PRUSART0	= 1		; 0x02 - Power Reduction USART0
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Internal 1.1V Voltage Reference with external capacitor at AREF pin
;			0xC0		; Internal 2.56V Voltage Reference with external capacitor at AREF pin
; ::::  MUX	>>>> This is a part of ADC_MUX_DIFF6 enum (see complete values list below)

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC  Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
;.equ	ACME		= 6		; 0x40 - 
.equ	MUX5		= 3		; 0x08 - Analog Channel and Gain Selection Bits
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Source bits (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event

; ----------	Register DIDR2 bits		------------------------
.equ	ADC15D		= 7		; 0x80 - 
.equ	ADC14D		= 6		; 0x40 - 
.equ	ADC13D		= 5		; 0x20 - 
.equ	ADC12D		= 4		; 0x10 - 
.equ	ADC11D		= 3		; 0x08 - 
.equ	ADC10D		= 2		; 0x04 - 
.equ	ADC9D		= 1		; 0x02 - 
.equ	ADC8D		= 0		; 0x01 - 

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - 
.equ	ADC6D		= 6		; 0x40 - 
.equ	ADC5D		= 5		; 0x20 - 
.equ	ADC4D		= 4		; 0x10 - 
.equ	ADC3D		= 3		; 0x08 - 
.equ	ADC2D		= 2		; 0x04 - 
.equ	ADC1D		= 1		; 0x02 - 
.equ	ADC0D		= 0		; 0x01 - 



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  ADC_MUX_DIFF6	:::: values
;			0b000000	; ADC Single Ended Input pin 0
;			0b000001	; ADC Single Ended Input pin 1
;			0b000010	; ADC Single Ended Input pin 2
;			0b000011	; ADC Single Ended Input pin 3
;			0b000100	; ADC Single Ended Input pin 4
;			0b000101	; ADC Single Ended Input pin 5
;			0b000110	; ADC Single Ended Input pin 6
;			0b000111	; ADC Single Ended Input pin 7
;			0b001000	; ADC Differential Inputs Positive pin 0 Negative pin 0 10x Gain
;			0b001001	; ADC Differential Inputs Positive pin 1 Negative pin 0 10x Gain
;			0b001010	; ADC Differential Inputs Positive pin 0 Negative pin 0 200x Gain
;			0b001011	; ADC Differential Inputs Positive pin 1 Negative pin 0 200x Gain
;			0b001100	; ADC Differential Inputs Positive pin 2 Negative pin 2 10x Gain
;			0b001101	; ADC Differential Inputs Positive pin 3 Negative pin 2 10x Gain
;			0b001110	; ADC Differential Inputs Positive pin 2 Negative pin 2 200x Gain
;			0b001111	; ADC Differential Inputs Positive pin 3 Negative pin 2 200x Gain
;			0b010000	; ADC Differential Inputs Positive pin 0 Negative pin 1 1x Gain
;			0b010001	; ADC Differential Inputs Positive pin 1 Negative pin 1 1x Gain
;			0b010010	; ADC Differential Inputs Positive pin 2 Negative pin 1 1x Gain
;			0b010011	; ADC Differential Inputs Positive pin 3 Negative pin 1 1x Gain
;			0b010100	; ADC Differential Inputs Positive pin 4 Negative pin 1 1x Gain
;			0b010101	; ADC Differential Inputs Positive pin 5 Negative pin 1 1x Gain
;			0b010110	; ADC Differential Inputs Positive pin 6 Negative pin 1 1x Gain
;			0b010111	; ADC Differential Inputs Positive pin 7 Negative pin 1 1x Gain
;			0b011000	; ADC Differential Inputs Positive pin 0 Negative pin 2 1x Gain
;			0b011001	; ADC Differential Inputs Positive pin 1 Negative pin 2 1x Gain
;			0b011010	; ADC Differential Inputs Positive pin 2 Negative pin 2 1x Gain
;			0b011011	; ADC Differential Inputs Positive pin 3 Negative pin 2 1x Gain
;			0b011100	; ADC Differential Inputs Positive pin 4 Negative pin 2 1x Gain
;			0b011101	; ADC Differential Inputs Positive pin 5 Negative pin 2 1x Gain
;			0b011110	; Internal Reference (VBG)
;			0b011111	; 0V (GND)
;			0b100000	; ADC Single Ended Input pin 8
;			0b100001	; ADC Single Ended Input pin 9
;			0b100010	; ADC Single Ended Input pin 10
;			0b100011	; ADC Single Ended Input pin 11
;			0b100100	; ADC Single Ended Input pin 12
;			0b100101	; ADC Single Ended Input pin 13
;			0b100110	; ADC Single Ended Input pin 14
;			0b100111	; ADC Single Ended Input pin 15
;			0b101000	; ADC Differential Inputs Positive pin 8 Negative pin 8 10x Gain
;			0b101001	; ADC Differential Inputs Positive pin 9 Negative pin 8 10x Gain
;			0b101010	; ADC Differential Inputs Positive pin 8 Negative pin 8 200x Gain
;			0b101011	; ADC Differential Inputs Positive pin 9 Negative pin 8 200x Gain
;			0b101100	; ADC Differential Inputs Positive pin 10 Negative pin 10 10x Gain
;			0b101101	; ADC Differential Inputs Positive pin 11 Negative pin 10 10x Gain
;			0b101110	; ADC Differential Inputs Positive pin 10 Negative pin 10 200x Gain
;			0b101111	; ADC Differential Inputs Positive pin 11 Negative pin 10 200x Gain
;			0b110000	; ADC Differential Inputs Positive pin 8 Negative pin 9 1x Gain
;			0b110001	; ADC Differential Inputs Positive pin 9 Negative pin 9 1x Gain
;			0b110010	; ADC Differential Inputs Positive pin 10 Negative pin 9 1x Gain
;			0b110011	; ADC Differential Inputs Positive pin 11 Negative pin 9 1x Gain
;			0b110100	; ADC Differential Inputs Positive pin 12 Negative pin 9 1x Gain
;			0b110101	; ADC Differential Inputs Positive pin 13 Negative pin 9 1x Gain
;			0b110110	; ADC Differential Inputs Positive pin 14 Negative pin 9 1x Gain
;			0b110111	; ADC Differential Inputs Positive pin 15 Negative pin 9 1x Gain
;			0b111000	; ADC Differential Inputs Positive pin 8 Negative pin 10 1x Gain
;			0b111001	; ADC Differential Inputs Positive pin 9 Negative pin 10 1x Gain
;			0b111010	; ADC Differential Inputs Positive pin 10 Negative pin 10 1x Gain
;			0b111011	; ADC Differential Inputs Positive pin 11 Negative pin 10 1x Gain
;			0b111100	; ADC Differential Inputs Positive pin 12 Negative pin 10 1x Gain
;			0b111101	; ADC Differential Inputs Positive pin 13 Negative pin 10 1x Gain



